math/differential-fields.org
#+TITLE: Differential Fields
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2020-12-23T16:16:49-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
# Created Wednesday December 23, 2020 at  4:16PM
#+INCLUDE: ../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

* Overview
:PROPERTIES:
:CUSTOM_ID: h-98e6773a-71b2-4c34-8d61-84f99cbdb3a5
:END:

If we want to try to symbolically solve differential equations, it is
tempting to think of analogous problems (like finding the roots of
polynomials). We just work over a differential ring, like $\mathbb{k}=\RR[{[x]}]$
the ring of formal power series with real coefficients (or rational
coefficients, or whatever), we can define a formal derivative operator:

\begin{equation}
\D (bx^{m} + cx^{n}) = \D(bx^{m}) +\D(cx^{n}) = mbx^{m-1} + ncx^{n-1}.
\end{equation}

Then we just translate the differential equation we're trying to solve

\begin{equation}
y' = f(x,y)
\end{equation}

into finding an element $y\in\mathbb{k}$ such that

\begin{equation}
\D y = f(x,y).
\end{equation}

* Polynomial Methods
:PROPERTIES:
:CUSTOM_ID: h-7c180687-c3b9-489c-b39a-68e04c6abc37
:END:

Given some representation of polynomials in a single variable, we review
a few helper functions that come in handy.

#+begin_theorem
If $R$ is a principal ideal domain,
then $(x,y) = (\gcd(x,y))$ for any $x,y\in R$.
#+end_theorem

#+begin_definition
A {{{define(Euclidean Domain)}}} consists of an [[file:rings/integral-domain.org][integral domain]] $(R, +, \cdot)$
equipped with a map $\nu\colon R\setminus\{0\}\to\mathbb{N}$ called the
{{{define(Size function)}}} such that

1. For all $a,b\in R\setminus\{0\}$, we have $\nu(ab)\leq\nu(a)$.
2. (Euclidean division) For any $a,b\in R$ with $b\neq0$ nonzero, there
   are $q,r\in R$ such that $a=bq+r$ and either $r=0$ or $\nu(r)\lt\nu(b)$.
#+end_definition

** Long Division
:PROPERTIES:
:CUSTOM_ID: h-751a7ac3-f79a-4642-b613-a920eeea32ca
:END:

We can use a naive long division algorithm.

#+begin_src lisp
(in-package :polynomial)
(defun divide (a b &aux q r s)
  "When A and B are polynomials over a field, division uses this method."
  (declare (type polynomial a b))
  (assert (not (zero? b)))
  (setf q (zero-polynomial))
  (setf r a)
  (loop while (and (not (zero? r))
                   (>= (degree r) (degree b)))
        do (progn
             (setf s (* (/ (leading-coef r)
                           (leading-coef b))
                        (expt 'x (- (degree r) (degree b)))))
             (setf q (+ q s))
             (setf r (- r (* b s)))))
  ;; (assert (equal? a (+ (* q b) r)))
  (values q r))
#+end_src

Arguably we could implement the quotient and remainder methods using
this.

#+begin_src lisp
(in-package :polynomial)

(defmethod quotient ((a polynomial) (b polynomial))
  (multiple-values-bind (q r) (divide a b)
                        q))

(defmethod rem ((a polynomial) (b polynomial))
  (multiple-values-bind (q r) (divide a b)
                        r))
#+end_src

** Pseudo-Division
:PROPERTIES:
:CUSTOM_ID: h-8e98244d-56f8-4963-88c3-1f78471eb2ae
:END:

When working over an integral domain $D$, we can't necessarily compute
the quotient and remainder of polynomials. But we can compute the /pseudo-quotient/
and /pseudo-remainder/ (really, they're more like /quasi-quotient/ and
/quasi-remainder/, since "pseudo" implies fraudulent, whereas "quasi"
implies "they share similar properties").

The pseudo-quotient is denoted $\mathrm{pquo}(A,B)$ and pseudo-remainder
denoted $\mathrm{prem}(A,B)$ by Bronstein.

#+begin_src lisp
(in-package :polynomial)
(defun pseudo-divide (a b &aux c n q r s)
  (declare (type polynomial a b))
  (assert (not (zero? b)))
  (setf c (leading-coef b))
  (setf n (1+ (- (degree a) (degree b))))
  (setf q 0)
  (setf r a)
  (loop while (and (not (zero? r))
                   (>= (- (degree r) (degree b)) 0))
        do (progn
             (setf s (* (leading-coef r)
                        (expt 'x (- (degree r) (degree b)))))
             (decf n)
             (setf q (+ s (* c q)))
             (setf r (- (* c r) (* s b)))))
  (let ((factor (expt c n)))
    (values (* factor q) (* factor r))))
#+end_src

** Euclidean Algorithm
:PROPERTIES:
:CUSTOM_ID: h-a3676324-9e86-4586-b707-27c267679ea9
:END:

There are several variations of Euclid's algorithm for GCD with polynomials.

#+begin_src lisp
(in-package :polynomial)
(defun euclid (a b &key (divide #'poly-divide) &aux x y)
  (declare (type polynomial a b))
  (setf x a)
  (setf y b)
  (loop while (not (zero? y))
        do (multiple-values-bind (q r)
                                 (funcall #'divide x y)
                                 (setf x y)
                                 (setf y r)))
  x)
#+end_src

