html/math/differential-fields.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Differential Fields</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Differential Fields</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org27c793e">1. Overview</a></li>
<li><a href="#org5ce4dab">2. Polynomial Methods</a>
<ul>
<li><a href="#orgc62507e">2.1. Long Division</a></li>
<li><a href="#org5c67d6b">2.2. Pseudo-Division</a></li>
<li><a href="#orgad851a2">2.3. Euclidean Algorithm</a>
<ul>
<li><a href="#orgab685e1">2.3.1. Extended Euclidean Algorithm</a></li>
<li><a href="#org3fff792">2.3.2. Half-Extended Euclidean</a></li>
<li><a href="#org66b665c">2.3.3. Euclidean Algorithm</a></li>
<li><a href="#org291e378">2.3.4. Diophantine version of Extended Euclidean</a></li>
<li><a href="#org25b2106">2.3.5. Diophantine Half-Extended Euclidean</a></li>
<li><a href="#org3143c2f">2.3.6. Partial Fraction Decomposition</a></li>
<li><a href="#org2a85cef">2.3.7. Partial Fraction Decomposition with Multiplicity</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org051b4de">3. Canonical Representation</a></li>
<li><a href="#orgd8b3bc2">4. References</a>
<ul>
<li><a href="#orge97d5f3">4.1. Also See</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org27c793e" class="outline-2">
<h2 id="org27c793e"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
If we want to try to symbolically solve differential equations, it is
tempting to think of analogous problems (like finding the roots of
polynomials). We just work over a differential ring, like \(\mathbb{k}=\RR[{[x]}]\)
the ring of formal power series with real coefficients (or rational
coefficients, or whatever), we can define a formal derivative operator:
</p>

\begin{equation}
\D (bx^{m} + cx^{n}) = \D(bx^{m}) +\D(cx^{n}) = mbx^{m-1} + ncx^{n-1}.
\end{equation}

<p>
Then we just translate the differential equation we're trying to solve
</p>

\begin{equation}
y' = f(x,y)
\end{equation}

<p>
into finding an element \(y\in\mathbb{k}\) such that
</p>

\begin{equation}
\D y = f(x,y).
\end{equation}
</div>
</div>

<div id="outline-container-org5ce4dab" class="outline-2">
<h2 id="org5ce4dab"><span class="section-number-2">2</span> Polynomial Methods</h2>
<div class="outline-text-2" id="text-2">
<p>
Given some representation of polynomials in a single variable, we review
a few helper functions that come in handy.
</p>

<div class="theorem" id="org5301b9b">
<p>
If \(R\) is a principal ideal domain,
then \((x,y) = (\gcd(x,y))\) for any \(x,y\in R\).
</p>

</div>

<div class="definition" id="orgbb819cb">
<p>
A <dfn>Euclidean Domain</dfn> consists of an <a href="rings/integral-domain.html">integral domain</a> \((R, +, \cdot)\)
equipped with a map \(\nu\colon R\setminus\{0\}\to\mathbb{N}\) called the
<dfn>Size function</dfn> such that
</p>

<ol class="org-ol">
<li>For all \(a,b\in R\setminus\{0\}\), we have \(\nu(ab)\leq\nu(a)\).</li>
<li>(Euclidean division) For any \(a,b\in R\) with \(b\neq0\) nonzero, there
are \(q,r\in R\) such that \(a=bq+r\) and either \(r=0\) or \(\nu(r)\lt\nu(b)\).</li>
</ol>

</div>
</div>

<div id="outline-container-orgc62507e" class="outline-3">
<h3 id="orgc62507e"><span class="section-number-3">2.1</span> Long Division</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We can use a naive long division algorithm.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">divide</span> (a b <span class="org-type">&amp;aux</span> q r s)
  <span class="org-doc">"When A and B are polynomials over a field, division uses this method."</span>
  (<span class="org-keyword">declare</span> (type polynomial a b))
  (<span class="org-warning">assert</span> (not (zero? b)))
  (setf q (zero-polynomial))
  (setf r a)
  (<span class="org-keyword">loop</span> while (and (not (zero? r))
                   (&gt;= (degree r) (degree b)))
        do (<span class="org-keyword">progn</span>
             (setf s (* (/ (leading-coef r)
                           (leading-coef b))
                        (expt 'x (- (degree r) (degree b)))))
             (setf q (+ q s))
             (setf r (- r (* b s)))))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(assert (equal? a (+ (* q b) r)))</span>
  (values q r))
</pre>
</div>

<p>
Arguably we could implement the quotient and remainder methods using
this.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)

(<span class="org-keyword">defmethod</span> <span class="org-function-name">quotient</span> ((a polynomial) (b polynomial))
  (multiple-values-bind (q r) (divide a b)
                        q))

(<span class="org-keyword">defmethod</span> <span class="org-function-name">rem</span> ((a polynomial) (b polynomial))
  (multiple-values-bind (q r) (divide a b)
                        r))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c67d6b" class="outline-3">
<h3 id="org5c67d6b"><span class="section-number-3">2.2</span> Pseudo-Division</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When working over an integral domain \(D\), we can't necessarily compute
the quotient and remainder of polynomials. But we can compute the <i>pseudo-quotient</i>
and <i>pseudo-remainder</i> (really, they're more like <i>quasi-quotient</i> and
<i>quasi-remainder</i>, since "pseudo" implies fraudulent, whereas "quasi"
implies "they share similar properties").
</p>

<p>
The pseudo-quotient is denoted \(\mathrm{pquo}(A,B)\) and pseudo-remainder
denoted \(\mathrm{prem}(A,B)\) by Bronstein.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">pseudo-divide</span> (a b <span class="org-type">&amp;aux</span> c n q r s)
  (<span class="org-keyword">declare</span> (type polynomial a b))
  (<span class="org-warning">assert</span> (not (zero? b)))
  (setf c (leading-coef b))
  (setf n (1+ (- (degree a) (degree b))))
  (setf q 0)
  (setf r a)
  (<span class="org-keyword">loop</span> while (and (not (zero? r))
                   (&gt;= (- (degree r) (degree b)) 0))
        do (<span class="org-keyword">progn</span>
             (setf s (* (leading-coef r)
                        (expt 'x (- (degree r) (degree b)))))
             (decf n)
             (setf q (+ s (* c q)))
             (setf r (- (* c r) (* s b)))))
  (<span class="org-keyword">let</span> ((factor (expt c n)))
    (values (* factor q) (* factor r))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad851a2" class="outline-3">
<h3 id="orgad851a2"><span class="section-number-3">2.3</span> Euclidean Algorithm</h3>
<div class="outline-text-3" id="text-2-3">
<p>
There are several variations of Euclid's algorithm for GCD with polynomials.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">euclid</span> (a b <span class="org-type">&amp;key</span> (divide #'poly-divide) <span class="org-type">&amp;aux</span> x y)
  (<span class="org-keyword">declare</span> (type polynomial a b))
  (setf x a)
  (setf y b)
  (<span class="org-keyword">loop</span> while (not (zero? y))
        do (multiple-values-bind (q r)
                                 (funcall #'divide x y)
                                 (setf x y)
                                 (setf y r)))
  x)
</pre>
</div>
</div>
