math/differential-fields.org
*** Extended Euclidean Algorithm
:PROPERTIES:
:CUSTOM_ID: h-f44a2567-777a-4120-ad6b-f041226af660
:END:

The "follow your nose" implementation of the extended Euclidean
algorithm could be implemented quite quickly.

#+begin_src lisp
(in-package :polynomial)
(defun naive-extended-euclid (a b &key (divide #'poly-divide) &aux r1 r2)
  (declare (type polynomial a b))
  (let ((a0 a)
        (a1 1)
        (a2 0)
        (b0 b)
        (b1 0)
        (b2 1))
    (loop while (not (zero? b0))
          do (multiple-values-bind (q r) (funcall #'divide a0 b0)
                                   ;; (= a0 (+ r (* b0 q)))
                                   (setf a0 b0)
                                   (setf b0 r)
                                   (setf r1 (- a1 (* q b1)))
                                   (setf r2 (- a2 (* q b2)))
                                   (setf a1 b1)
                                   (setf a2 b2)
                                   (setf b1 r1)
                                   (setf b2 r2)))
    ;; (assert (equal? (+ (* a1 a) (* a2 b)) a0))
    (values a1 a2 a)))
#+end_src

*** Half-Extended Euclidean
:PROPERTIES:
:CUSTOM_ID: h-590cbbf3-ad55-4a26-9e49-d0c7f1ef9832
:END:

Alas, if we need only one of the coefficients =s= or ~t~, we can use a
variant of the Euclidean algorithm which Bronstein calls the
"half-extended Euclidean algorithm" (over some Euclidean domain ~D~):

#+begin_src lisp
(in-package :polynomial)
(defun half-extended-euclid (a b &key (divide #'poly-divide) &aux r1)
  (let ((a0 a)
        (a1 1)
        (b0 b)
        (b1 0))
    (loop while (not (zero? b0))
          do (multiple-values-bind (q r) (funcall #'divide a0 b0)
                                   ;; (= a0 (+ r (* b0 q)))
                                   (setf a0 b0)
                                   (setf b0 r)
                                   (setf r1 (- a1 (* q b1)))
                                   (setf a1 b1)
                                   (setf b1 r1)))
    (values a1 a)))
#+end_src

*** Euclidean Algorithm
:PROPERTIES:
:CUSTOM_ID: h-88893e7a-9439-47d6-9721-956d5796b621
:END:

We can use this half-extended Euclidean algorithm for a more efficient
implementation of Euclid's algorithm.

#+begin_src lisp
(in-package :polynomial)
(defun extended-euclid (a b &key (divide #'poly-divide) &aux u v)
  (declare (type polynomial a b))
  (multiple-values-bind (s g) (half-extended-euclid a b :divide #'divide)
                        (values s (funcall #'divide (- g (* s a)) b) g)))
#+end_src

*** Diophantine version of Extended Euclidean
:PROPERTIES:
:CUSTOM_ID: h-09dee665-f595-430f-b349-0001d8e5da4d
:END:

We can use the extended Euclidean algorithm to solve Diophantine
equations of the form $sa+tb=c$ where $a,b,c\in D$ are given and $s,t\in D$
are the unknowns.


#+begin_src lisp
(defun diophantine-naive-extended-euclid (a b c)
  (multiple-values-bind
   (s u g) (extended-euclid a b)
   (multiple-values-bind (q r) (poly-divide c g)
                         (unless (zero? r)
                           (error "~A is not generated in the ideal by ~A and ~A"
                                  c a b))
                         (setf s (* q s))
                         (setf u (* q u)))
   (when (and (not (zero? s))
              (>= (degree s) (degree b)))
     (multiple-values-bind
      (q r) (poly-divide s b)
      (setf s r)
      (setf u (+ u (* q a)))))
   (values s u))
#+end_src

*** Diophantine Half-Extended Euclidean
:PROPERTIES:
:CUSTOM_ID: h-9b99a81d-bf15-4199-b5d8-e7e6f334f34f
:END:

When we only want the ~s~ in the Euclidean domain such that ~s*a = c~
modulo ~b~ and either ~s = 0~ or ~nu(s) < nu(b)~. The other solution is
obtained by

\begin{equation}
t = \frac{c - sa}{b}
\end{equation}

where the division is always exact.

#+begin_src lisp
(defun diophantine-half-extended-euclidean (a b c)
  (multiple-values-bind
   (s g) (half-extended-euclidean a b)
   (multiple-values-bind
    (q r) (poly-divide c g)
    (unless (zero? r)
      (error "~A is not the ideal generated by ~A and ~A"
             c a b))
    (setf s (* q s)))
   (when (and (not (zero? s))
              (>= (degree s) (degree b)))
     (multiple-values-bind
      (q r) (poly-divide s b)
      ;; (assert (equal? s (+ r (* b q))))
      (setf s r)))
   s)
#+end_src

This gives us a more efficient diophantine extended Euclidean method

#+begin_src lisp
(defun diophantine-extended-euclidean (a b c)
  (let ((s (diophantine-half-extended-euclidean a b c)))
    (multiple-values-bind
     (q r) (poly-divide (- c (* s a)) b))
    (values s q)))
#+end_src

*** Partial Fraction Decomposition
:PROPERTIES:
:CUSTOM_ID: h-74646ae1-4018-4052-8462-5ce4142bac65
:END:

We can use Euclidean Algorithm to determine the partial fraction
decomposition of a ratio of polynomials. For $a/d$ we consider the
factorization $d = d_{1}\dots d_{n}$ into distinct coprime (not necessarily
irreducible) factors $\gcd(d_{i},d_{j})=1$ for $i\neq j$.

#+begin_src lisp
(defun distinct-partial-fraction (a &rest denom-factors)
  "Returns a list of a constant term followed by numerators for
the corresponding denominator factors."
  (if (null denom-factors)
      a
      (multiple-values-bind
       (a0 r) (poly-divide a (apply #'* denom-factors))
       (when (singleton? denom-factors) ; n = 1
         (return-from distinct-partial-fraction (cons a0 r)))
       (multiple-values-bind            ; n > 1
        (a1 s) (extended-euclidean (apply #'* (cdr denom-factors)) r)
        (assert (< (degree a1) (degree (car denom-factors))))
        (let ((numerators (apply #'distinct-partial-fraction s (cdr denom-factors))))
          (cons (+ a0 (car numerators))
                (cons a1 (cdr numerators))))))))
#+end_src

