html/math/differential-fields.html

<div id="outline-container-orgab685e1" class="outline-4">
<h4 id="orgab685e1"><span class="section-number-4">2.3.1</span> Extended Euclidean Algorithm</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
The "follow your nose" implementation of the extended Euclidean
algorithm could be implemented quite quickly.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">naive-extended-euclid</span> (a b <span class="org-type">&amp;key</span> (divide #'poly-divide) <span class="org-type">&amp;aux</span> r1 r2)
  (<span class="org-keyword">declare</span> (type polynomial a b))
  (<span class="org-keyword">let</span> ((a0 a)
        (a1 1)
        (a2 0)
        (b0 b)
        (b1 0)
        (b2 1))
    (<span class="org-keyword">loop</span> while (not (zero? b0))
          do (multiple-values-bind (q r) (funcall #'divide a0 b0)
                                   <span class="org-comment-delimiter">;; </span><span class="org-comment">(= a0 (+ r (* b0 q)))</span>
                                   (setf a0 b0)
                                   (setf b0 r)
                                   (setf r1 (- a1 (* q b1)))
                                   (setf r2 (- a2 (* q b2)))
                                   (setf a1 b1)
                                   (setf a2 b2)
                                   (setf b1 r1)
                                   (setf b2 r2)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">(assert (equal? (+ (* a1 a) (* a2 b)) a0))</span>
    (values a1 a2 a)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fff792" class="outline-4">
<h4 id="org3fff792"><span class="section-number-4">2.3.2</span> Half-Extended Euclidean</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Alas, if we need only one of the coefficients <code>s</code> or <code>t</code>, we can use a
variant of the Euclidean algorithm which Bronstein calls the
"half-extended Euclidean algorithm" (over some Euclidean domain <code>D</code>):
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">half-extended-euclid</span> (a b <span class="org-type">&amp;key</span> (divide #'poly-divide) <span class="org-type">&amp;aux</span> r1)
  (<span class="org-keyword">let</span> ((a0 a)
        (a1 1)
        (b0 b)
        (b1 0))
    (<span class="org-keyword">loop</span> while (not (zero? b0))
          do (multiple-values-bind (q r) (funcall #'divide a0 b0)
                                   <span class="org-comment-delimiter">;; </span><span class="org-comment">(= a0 (+ r (* b0 q)))</span>
                                   (setf a0 b0)
                                   (setf b0 r)
                                   (setf r1 (- a1 (* q b1)))
                                   (setf a1 b1)
                                   (setf b1 r1)))
    (values a1 a)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org66b665c" class="outline-4">
<h4 id="org66b665c"><span class="section-number-4">2.3.3</span> Euclidean Algorithm</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
We can use this half-extended Euclidean algorithm for a more efficient
implementation of Euclid's algorithm.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">in-package</span> <span class="org-builtin">:polynomial</span>)
(<span class="org-keyword">defun</span> <span class="org-function-name">extended-euclid</span> (a b <span class="org-type">&amp;key</span> (divide #'poly-divide) <span class="org-type">&amp;aux</span> u v)
  (<span class="org-keyword">declare</span> (type polynomial a b))
  (multiple-values-bind (s g) (half-extended-euclid a b <span class="org-builtin">:divide</span> #'divide)
                        (values s (funcall #'divide (- g (* s a)) b) g)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org291e378" class="outline-4">
<h4 id="org291e378"><span class="section-number-4">2.3.4</span> Diophantine version of Extended Euclidean</h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
We can use the extended Euclidean algorithm to solve Diophantine
equations of the form \(sa+tb=c\) where \(a,b,c\in D\) are given and \(s,t\in D\)
are the unknowns.
</p>


<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">diophantine-naive-extended-euclid</span> (a b c)
  (multiple-values-bind
   (s u g) (extended-euclid a b)
   (multiple-values-bind (q r) (poly-divide c g)
                         (<span class="org-keyword">unless</span> (zero? r)
                           (<span class="org-warning">error</span> <span class="org-string">"~A is not generated in the ideal by ~A and ~A"</span>
                                  c a b))
                         (setf s (* q s))
                         (setf u (* q u)))
   (<span class="org-keyword">when</span> (and (not (zero? s))
              (&gt;= (degree s) (degree b)))
     (multiple-values-bind
      (q r) (poly-divide s b)
      (setf s r)
      (setf u (+ u (* q a)))))
   (values s u))
</pre>
</div>
</div>
</div>

<div id="outline-container-org25b2106" class="outline-4">
<h4 id="org25b2106"><span class="section-number-4">2.3.5</span> Diophantine Half-Extended Euclidean</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
When we only want the <code>s</code> in the Euclidean domain such that <code>s*a = c</code>
modulo <code>b</code> and either <code>s = 0</code> or <code>nu(s) &lt; nu(b)</code>. The other solution is
obtained by
</p>

\begin{equation}
t = \frac{c - sa}{b}
\end{equation}

<p>
where the division is always exact.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">diophantine-half-extended-euclidean</span> (a b c)
  (multiple-values-bind
   (s g) (half-extended-euclidean a b)
   (multiple-values-bind
    (q r) (poly-divide c g)
    (<span class="org-keyword">unless</span> (zero? r)
      (<span class="org-warning">error</span> <span class="org-string">"~A is not the ideal generated by ~A and ~A"</span>
             c a b))
    (setf s (* q s)))
   (<span class="org-keyword">when</span> (and (not (zero? s))
              (&gt;= (degree s) (degree b)))
     (multiple-values-bind
      (q r) (poly-divide s b)
      <span class="org-comment-delimiter">;; </span><span class="org-comment">(assert (equal? s (+ r (* b q))))</span>
      (setf s r)))
   s)
</pre>
</div>

<p>
This gives us a more efficient diophantine extended Euclidean method
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">diophantine-extended-euclidean</span> (a b c)
  (<span class="org-keyword">let</span> ((s (diophantine-half-extended-euclidean a b c)))
    (multiple-values-bind
     (q r) (poly-divide (- c (* s a)) b))
    (values s q)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org3143c2f" class="outline-4">
<h4 id="org3143c2f"><span class="section-number-4">2.3.6</span> Partial Fraction Decomposition</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
We can use Euclidean Algorithm to determine the partial fraction
decomposition of a ratio of polynomials. For \(a/d\) we consider the
factorization \(d = d_{1}\dots d_{n}\) into distinct coprime (not necessarily
irreducible) factors \(\gcd(d_{i},d_{j})=1\) for \(i\neq j\).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">distinct-partial-fraction</span> (a <span class="org-type">&amp;rest</span> denom-factors)
  <span class="org-doc">"Returns a list of a constant term followed by numerators for</span>
<span class="org-doc">the corresponding denominator factors."</span>
  (<span class="org-keyword">if</span> (null denom-factors)
      a
      (multiple-values-bind
       (a0 r) (poly-divide a (apply #'* denom-factors))
       (<span class="org-keyword">when</span> (singleton? denom-factors) <span class="org-comment">; n = 1</span>
         (<span class="org-keyword">return-from</span> distinct-partial-fraction (cons a0 r)))
       (multiple-values-bind            <span class="org-comment">; n &gt; 1</span>
        (a1 s) (extended-euclidean (apply #'* (cdr denom-factors)) r)
        (<span class="org-warning">assert</span> (&lt; (degree a1) (degree (car denom-factors))))
        (<span class="org-keyword">let</span> ((numerators (apply #'distinct-partial-fraction s (cdr denom-factors))))
          (cons (+ a0 (car numerators))
                (cons a1 (cdr numerators))))))))
</pre>
</div>
</div>
</div>
