math/differential-fields.org
*** Partial Fraction Decomposition with Multiplicity
:PROPERTIES:
:CUSTOM_ID: h-c5046482-1209-4124-9a15-b5975ba58338
:END:

We explicitly assumed each factor $d_{i}$ was coprime with each other.
But what happens if $d$ has a square factor $d_{i}^{2}$? Or more
generally a factor $d_{j}^{e_{j}}$ with nonzero $e_{j}\in\mathbb{N}$?
How do we do a partial fraction decomposition in this case?

The idea is to use the so-called {{{define(d-adic expansion)}}} of $a/d^{m}$,
writing $a=dq+a_{m}$ by Euclidean division (where either $a_{m}=0$ or $\nu(a_{m})\lt\nu(d)$).
Then

\begin{equation}
\frac{a}{d^{m}}
= \frac{dq + a_{m}}{d^{m}}
= \frac{q}{d^{m-1}} + \frac{a_{m}}{d^{m}}.
\end{equation}

If $m=1$, we're done. Otherwise, we recursively find $a_{0}$, $a_{1}$,
..., $a_{m-1}\in D$ such that either $a_{j}=0$ or $\nu(a_{j})\lt\nu(d)$
for $j\geq1$, and

\begin{equation}
\frac{q}{d^{m-1}} = a_{0} + \sum^{m-1}_{j=1}\frac{a_{j}}{d^{j}}.
\end{equation}

Thus

\begin{equation}
\frac{a}{d^{m}} = \frac{q}{d^{m-1}} + \frac{a_{m}}{d^{m}} = a_{0} + \sum^{m}_{j=1}\frac{a_{j}}{d^{j}}.
\end{equation}

Now if we have a factorization of $d=d_{1}^{e_{1}}d_{2}^{e_{2}}\dots d_{n}^{e_{n}}$
(not necessarily into irreducibles) where $\gcd(d_{i},d_{j})=1$ for any
$i\neq j$ and the $e_{i}\in\mathbb{N}$. What to do? We take $b_{i} = d_{i}^{e_{i}}$ for
each $i$, we use the partial fraction decomposition from the previous
section

\begin{equation}
\frac{a}{d} = a_{0} + \sum^{n}_{j=1}\frac{a_{j}}{b_{j}}
= a_{0} + \sum^{n}_{j=1}\frac{a_{j}}{d_{j}^{e_{j}}}.
\end{equation}

And we use the \(d_{j}\)-adic expansion of each summand to get

\begin{equation}
\frac{a}{d}
= \widetilde{a} + \sum^{n}_{i=1}\sum^{e_{i}}_{j=1}\frac{a_{ij}}{d_{i}^{j}}.
\end{equation}

This is the complete partial fraction decomposition of $a/d$ with
respect to the factorization $d = \prod_{i} d_{i}^{e_{i}}$.

#+begin_src lisp
(defun complete-partial-fraction (a &rest denom-expt-pairs)
  (let* ((all-numerators (apply #'distinct-partial-fraction
                                (cons a (mapcar #'(lambda (d-e)
                                                    (expt (car d-e) (cadr d-e)))
                                                denom-expt-pairs))))
         (a0 (car all-numerators))
         (numerators (cdr all-numerators)))
    (do ((d-e-pairs denom-expt-pairs))
        ()
      (do ((
    ))
#+end_src

# 34

* Canonical Representation
:PROPERTIES:
:CUSTOM_ID: h-08823f23-c088-4e0d-8ede-0cff084699f0
:END:

Usually we have a field of rational polynomial $\mathbb{k}=\mathbb{Q}(x)$
with $D=\D/\D x$, and $t$ a monomial over $\mathbb{k}$ such that

\begin{equation}
Dt = -t^{2}-\frac{3}{2x}t + \frac{1}{2x}
\end{equation}

Then we'll want to split a given polynomial

#+begin_src lisp
(defun split-factor (p deriv)
  "Given a derivation `deriv' on `k[t]' and `p' an element of `k[t]',
return the pair (normal-polynomial . special-polynomial) such that
(= p (* normal-polynomial special-polynomial))."
  (let ((s (/ (gcd p (deriv p))
              (gcd p (d p t)))))
    (if (zerop (degree s))
        (cons p 1)
      (split-factor (/ p s) deriv))))
#+end_src

* References
:PROPERTIES:
:CUSTOM_ID: h-17b4392e-7077-4233-8f29-289bbb4574da
:END:
- Manuel Bronstein, {{{book-title(Symbolic Integration 1: Transcendental Functions)}}}.
  Springer, second ed., 1996.

** Also See
:PROPERTIES:
:CUSTOM_ID: h-6faf3e58-92a3-42a5-8528-3eef7ae5133b
:END:

- Marius van Der Pu, Michael F. Singer,
  {{{book-title(Galois Theory of Linear Differential Equations)}}}.
  Springer, 2003.
