html/math/differential-fields.html

<div id="outline-container-org2a85cef" class="outline-4">
<h4 id="org2a85cef"><span class="section-number-4">2.3.7</span> Partial Fraction Decomposition with Multiplicity</h4>
<div class="outline-text-4" id="text-2-3-7">
<p>
We explicitly assumed each factor \(d_{i}\) was coprime with each other.
But what happens if \(d\) has a square factor \(d_{i}^{2}\)? Or more
generally a factor \(d_{j}^{e_{j}}\) with nonzero \(e_{j}\in\mathbb{N}\)?
How do we do a partial fraction decomposition in this case?
</p>

<p>
The idea is to use the so-called <dfn>d-adic expansion</dfn> of \(a/d^{m}\),
writing \(a=dq+a_{m}\) by Euclidean division (where either \(a_{m}=0\) or \(\nu(a_{m})\lt\nu(d)\)).
Then
</p>

\begin{equation}
\frac{a}{d^{m}}
= \frac{dq + a_{m}}{d^{m}}
= \frac{q}{d^{m-1}} + \frac{a_{m}}{d^{m}}.
\end{equation}

<p>
If \(m=1\), we're done. Otherwise, we recursively find \(a_{0}\), \(a_{1}\),
&#x2026;, \(a_{m-1}\in D\) such that either \(a_{j}=0\) or \(\nu(a_{j})\lt\nu(d)\)
for \(j\geq1\), and
</p>

\begin{equation}
\frac{q}{d^{m-1}} = a_{0} + \sum^{m-1}_{j=1}\frac{a_{j}}{d^{j}}.
\end{equation}

<p>
Thus
</p>

\begin{equation}
\frac{a}{d^{m}} = \frac{q}{d^{m-1}} + \frac{a_{m}}{d^{m}} = a_{0} + \sum^{m}_{j=1}\frac{a_{j}}{d^{j}}.
\end{equation}

<p>
Now if we have a factorization of \(d=d_{1}^{e_{1}}d_{2}^{e_{2}}\dots d_{n}^{e_{n}}\)
(not necessarily into irreducibles) where \(\gcd(d_{i},d_{j})=1\) for any
\(i\neq j\) and the \(e_{i}\in\mathbb{N}\). What to do? We take \(b_{i} = d_{i}^{e_{i}}\) for
each \(i\), we use the partial fraction decomposition from the previous
section
</p>

\begin{equation}
\frac{a}{d} = a_{0} + \sum^{n}_{j=1}\frac{a_{j}}{b_{j}}
= a_{0} + \sum^{n}_{j=1}\frac{a_{j}}{d_{j}^{e_{j}}}.
\end{equation}

<p>
And we use the \(d_{j}\)-adic expansion of each summand to get
</p>

\begin{equation}
\frac{a}{d}
= \widetilde{a} + \sum^{n}_{i=1}\sum^{e_{i}}_{j=1}\frac{a_{ij}}{d_{i}^{j}}.
\end{equation}

<p>
This is the complete partial fraction decomposition of \(a/d\) with
respect to the factorization \(d = \prod_{i} d_{i}^{e_{i}}\).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">complete-partial-fraction</span> (a <span class="org-type">&amp;rest</span> denom-expt-pairs)
  (<span class="org-keyword">let*</span> ((all-numerators (apply #'distinct-partial-fraction
                                (cons a (mapcar #'(<span class="org-keyword">lambda</span> (d-e)
                                                    (expt (car d-e) (cadr d-e)))
                                                denom-expt-pairs))))
         (a0 (car all-numerators))
         (numerators (cdr all-numerators)))
    (<span class="org-keyword">do</span> ((d-e-pairs denom-expt-pairs))
        ()
      (<span class="org-keyword">do</span> ((
    ))
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org051b4de" class="outline-2">
<h2 id="org051b4de"><span class="section-number-2">3</span> Canonical Representation</h2>
<div class="outline-text-2" id="text-3">
<p>
Usually we have a field of rational polynomial \(\mathbb{k}=\mathbb{Q}(x)\)
with \(D=\D/\D x\), and \(t\) a monomial over \(\mathbb{k}\) such that
</p>

\begin{equation}
Dt = -t^{2}-\frac{3}{2x}t + \frac{1}{2x}
\end{equation}

<p>
Then we'll want to split a given polynomial
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">split-factor</span> (p deriv)
  <span class="org-doc">"Given a derivation `</span><span class="org-doc"><span class="org-constant">deriv</span></span><span class="org-doc">' on `</span><span class="org-doc"><span class="org-constant">k[t]</span></span><span class="org-doc">' and `p' an element of `</span><span class="org-doc"><span class="org-constant">k[t]</span></span><span class="org-doc">',</span>
<span class="org-doc">return the pair (normal-polynomial . special-polynomial) such that</span>
<span class="org-doc">(= p (* normal-polynomial special-polynomial))."</span>
  (<span class="org-keyword">let</span> ((s (/ (gcd p (deriv p))
              (gcd p (d p t)))))
    (<span class="org-keyword">if</span> (zerop (degree s))
        (cons p 1)
      (split-factor (/ p s) deriv))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8b3bc2" class="outline-2">
<h2 id="orgd8b3bc2"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Manuel Bronstein, <cite class="book-title">Symbolic Integration 1: Transcendental Functions</cite>.
Springer, second ed., 1996.</li>
</ul>
</div>

<div id="outline-container-orge97d5f3" class="outline-3">
<h3 id="orge97d5f3"><span class="section-number-3">4.1</span> Also See</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Marius van Der Pu, Michael F. Singer,
<cite class="book-title">Galois Theory of Linear Differential Equations</cite>.
Springer, 2003.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-02-14 Sun 12:35.</p>
</div>
</body>
</html>